BAS BMEKZU Project/src/Reports/ИНАГРО_СреднеучетнаяЧисленностьСотрудниковЭПЗ/ИНАГРО_СреднеучетнаяЧисленностьСотрудниковЭПЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ИНАГРО_СреднеучетнаяЧисленностьСотрудниковЭПЗ</name>
  <attributes>
    <name>ПостроительОтчета</name>
    <type>
      <types>ReportBuilder</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьЗаголовок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Настройки</name>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СредняяЗарплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
</mdclass:Report>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_РаботникиОрганизаций/ИНАГРО_РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_РаботникиОрганизаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </resources>
  <resources>
    <name>ПринятНаНовоеРабочееМесто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзменениеДолжности</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредыдущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>РаботаСНефиксированнымРабочимВременем</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>УдалитьТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияРабочегоМеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКЗоТ</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьФизлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПриказ</name>
    <type>
      <types>DocumentRef.УдалитьПриемНаРаботуВОрганизацию</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/InformationRegisters/СведенияОбИнвалидностиФизическихЛиц/СведенияОбИнвалидностиФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОбИнвалидностиФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Инвалидность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнвалидностьПоОкончании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>СерияСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСправки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаИнвалидности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияСправки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/CalculationRegisters/ИНАГРО_Начисления/ИНАГРО_Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ИНАГРО_Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ИНАГРО_ГрафикиРаботыПоВидамВремени</schedule>
  <scheduleValue>InformationRegister.ИНАГРО_ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</scheduleValue>
  <scheduleDate>InformationRegister.ИНАГРО_ГрафикиРаботыПоВидамВремени.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ИНАГРО_Начисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоДнейЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ИНАГРО_ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремени</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыУчетаВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСреднегоЗаработкаНачало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаСреднегоЗаработкаКонец</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаСотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаПриказ</name>
    <type>
      <types>DocumentRef.ИНАГРО_ПриемНаРаботуВОрганизацию</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef.ИНАГРО_Начисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаКоличествоСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаДнейЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НормаЧасовЗаМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авторасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияВБухучете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремениДляСредней</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыУчетаВремениДляСредней</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом</types>
      <types>DocumentRef.ИНАГРО_ЗаменыРаботниковОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <recalculations>
    <name>ИНАГРО_ПерерасчетНачислений</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_РегламентированныйПроизводственныйКалендарь/ИНАГРО_РегламентированныйПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_РегламентированныйПроизводственныйКалендарь</name>
  <resources>
    <name>КалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидДня</name>
    <type>
      <types>EnumRef.ИНАГРО_ВидыДнейПроизводственногоКалендаря</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПереноса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятости</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Reports/ИНАГРО_СреднеучетнаяЧисленностьСотрудниковЭПЗ/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

// Процедура СформироватьПараметрыОтчета
//
Процедура СформироватьПараметрыОтчета() Экспорт
	
	// Определение списка работников, попадающих в отчетный период
	МассивВидЗанятости    = Новый Массив(2);
	МассивВидЗанятости[0] = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы;
	МассивВидЗанятости[1] = Перечисления.ВидыЗанятости.Совместительство;
	ПостроительОтчета.Параметры.Вставить("ПарамОсновнойСотрудник",   МассивВидЗанятости);
                                                               
	ПостроительОтчета.Параметры.Вставить("парамНачало",			НачалоПериода);
	ПостроительОтчета.Параметры.Вставить("парамКонец",			КонецМесяца(КонецПериода) );
	ПостроительОтчета.Параметры.Вставить("парамОрганизация",	ПостроительОтчета.Отбор.Организация.Значение);
	ПостроительОтчета.Параметры.Вставить("парамПустаяБуква",	Справочники.ИНАГРО_КлассификаторИспользованияРабочегоВремени.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("парамДоговорПодряда",	ПланыВидовРасчета.ИНАГРО_Начисления.ОплатаПоДоговоруГПХ);
	ПостроительОтчета.Параметры.Вставить("ОбозначениеРабочееВремя",	Справочники.ИНАГРО_КлассификаторИспользованияРабочегоВремени.Работа);
	ПостроительОтчета.Параметры.Вставить("ДнейВМесяце",	День(КонецМесяца(КонецПериода)) );
	                                
	КоличествоМесяцев = (Год(КонецПериода) - Год(НачалоПериода))*12 + Месяц(КонецПериода) - Месяц(НачалоПериода) + 1;
	ПостроительОтчета.Параметры.Вставить("парамКоличествоМесяцев",	КоличествоМесяцев);
	
	спФизЛиц = ПолучитьОтбор(ВидОтчета);
	ПостроительОтчета.Параметры.Вставить("парамФизЛицо",		спФизЛиц);
		
	ПостроительОтчета.Параметры.Вставить("парамСредняяЗП",		СредняяЗарплата);
	
КонецПроцедуры

//  Процедура СформироватьОтчет
//
Функция СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ТолькоЗаголовок = Ложь) Экспорт
	
	
	ДокументРезультат.Очистить();
	ЗаполнитьНачальныеНастройки();
	
	Макет	= ПолучитьМакет("Макет");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = Локализация.ПолучитьЯзыкФормированияПечатныхФорм();
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ПостроительОтчета.Макет = Макет;
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	
	Если ТолькоЗаголовок Тогда
		
		ДокументРезультат.Вывести(ЗаголовокОтчета);
		Возврат Неопределено;
		
	КонецЕсли;
	
	ПостроительОтчета.МакетЗаголовкаОтчета = ЗаголовокОтчета;
	ВысотаЗаголовка                        = ЗаголовокОтчета.ВысотаТаблицы;
	
	ПостроительОтчета.Отбор.Организация.Значение = Организация;
	ПостроительОтчета.Отбор.Организация.Использование = ЗначениеЗаполнено(Организация) ;
	ОтборОрганизации        = ПостроительОтчета.Отбор.Организация.Использование;
	Организация             = ПостроительОтчета.Отбор.Организация.Значение;	
	ВидСравненияОрганизации = ПостроительОтчета.Отбор.Организация.ВидСравнения;

	ПостроительОтчета.Отбор.Подразделение.Значение = Подразделение;
	ПостроительОтчета.Отбор.Подразделение.Использование = ЗначениеЗаполнено(Подразделение) ;
	ОтборПодразделения        = ПостроительОтчета.Отбор.Подразделение.Использование; 
	Подразделение             = ПостроительОтчета.Отбор.Подразделение.Значение;
	ВидСравненияПодразделение = ПостроительОтчета.Отбор.Подразделение.ВидСравнения;

	
	СформироватьПараметрыОтчета();
	                                           
	ПостроительОтчета.Выполнить();
	ПостроительОтчета.ОформитьМакет();
	ПостроительОтчета.Вывести(ДокументРезультат);
	
	Ширина = ДокументРезультат.ШиринаТаблицы;
	ВысотаТаблицы = ДокументРезультат.ВысотаТаблицы;
	ВысотаЗаголовка = ВысотаЗаголовка + 1;
	
	Область = ДокументРезультат.Область(ВысотаЗаголовка, 4);
	Возврат Макет;
КонецФункции

// Расчитывает среднесписочную численность штатных работников и в эквиваленте полной занятости.
//
// Параметры
//  ВидСредней  – Строка – "ЭПЗ", "ССЧ"
//  ВидПериода  – Строка – "МЕСЯЦ", "КВАРТАЛ", "ГОД", "КВАРТАЛСНАЧАЛАГОДА", "МЕСЯЦСНАЧАЛАГОДА" 
//  Организация  – ссылка – организация
//  ПараметрОтбора  – Строка – "" = по всем, "Ж" = Женщины, "Инв" = Инвалиды, 
//					"Пен" = пенсионеры, "ГПХ" - работающие по договору ГПХ
//  ПоФизЛицам      – Булево – разворачивать или нет до физ. лиц.
//
// Возвращаемое число:
//   таблица значений   – Колонки: Период и Сумма.
//
Функция ПолучитьСотрудников( УсловиеНаФизлицо = "" )
	// сотрудники В разрезе периодов
	ТекстСотрудникиОрганизации = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиПериод.Организация					КАК Организация,
	|	РаботникиПериод.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|	РаботникиПериод.Сотрудник					КАК Сотрудник,
	|	РаботникиПериод.Начало						КАК Начало,
	|   ВЫБОР	КОГДА РаботникиПериод.Конец ЕСТЬ NULL  ИЛИ РаботникиПериод.КОНЕЦ > &парамКонец
	|   			ТОГДА &парамКонец 
	|   		ИНАЧЕ  НАЧАЛОПЕРИОДА(РаботникиПериод.Конец, ДЕНЬ)  
	|   		КОНЕЦ     КАК КОНЕЦ
	|	ИЗ (
	|		ВЫБРАТЬ
	|			РаботникиНачало.Организация					КАК Организация,
	|			РаботникиНачало.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|			РаботникиНачало.Сотрудник					КАК Сотрудник,
	|			РаботникиНачало.Начало						КАК Начало,
	|			ВЫБОР КОГДА РаботникиНачало.Договор ЕСТЬ NULL
	|			ТОГДА МИНИМУМ(Работники.Период)
	|			ИНАЧЕ МИНИМУМ(ДОБАВИТЬКДАТЕ(Договоры.ДатаОкончания,ДЕНЬ,1))
	|			КОНЕЦ КАК КОНЕЦ
	|
	|		ИЗ	(
	|
	|			ВЫБРАТЬ
	|				Работники.Организация				КАК Организация,
	|				Работники.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|				Работники.Сотрудник					КАК Сотрудник,
	|				&парамНачало						КАК Начало,
	|				NULL КАК Договор
	|			ИЗ	РегистрСведений.ИНАГРО_РаботникиОрганизаций.СрезПоследних(&парамНачало) КАК Работники
	|			ГДЕ	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)                                       
	|			" + УсловиеНаФизлицо + "
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|			ВЫБРАТЬ
	|				Работники.Организация				КАК Организация,
	|				Работники.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|				Работники.Сотрудник					КАК Сотрудник,
	|				Работники.Период					КАК Начало,
	|				NULL КАК Договор	
	|			ИЗ	РегистрСведений.ИНАГРО_РаботникиОрганизаций КАК Работники
	|			ГДЕ	Работники.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			И	Работники.Период >= &парамНачало
	|			И	Работники.Период <= &парамКонец
	|			" + УсловиеНаФизлицо + "
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|			ВЫБРАТЬ
	|				Работники.Организация				КАК Организация,
	|				Работники.ПодразделениеОрганизации	КАК ПодразделениеОрганизации,
	|				Работники.Сотрудник					КАК Сотрудник,
	|				&парамНачало						КАК Начало,
	|				Работники.Ссылка
	|			ИЗ  Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом КАК Работники
	|	
	|			ГДЕ Работники.Проведен
	|			И Работники.ДатаОкончания >= &парамНачало
	|			И Работники.ДатаНачала <= &парамКонец
	|			" + УсловиеНаФизлицо + "
	|   	) КАК РаботникиНачало
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИНАГРО_РаботникиОрганизаций КАК Работники
	|		ПО		РаботникиНачало.Сотрудник = Работники.Сотрудник
	|			И   РаботникиНачало.Начало < Работники.Период
	|			И (Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|				ИЛИ Работники.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Перемещение))
	|			" + УсловиеНаФизлицо + "
	|       ЛЕВОЕ СОЕДИНЕНИЕ	
	|        Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом КАК Договоры
	|        ПО РаботникиНачало.Сотрудник = Договоры.Сотрудник
	|        И РаботникиНачало.Договор = Договоры.Ссылка
	|        И Договоры.ДатаОкончания < &парамКонец
    |
	|
	|   	СГРУППИРОВАТЬ ПО
	|			РаботникиНачало.Организация,
	|			РаботникиНачало.ПодразделениеОрганизации,
	|			РаботникиНачало.Сотрудник,
	|			РаботникиНачало.Начало,
	|			РаботникиНачало.Договор,
	|			Договоры.ДатаОкончания
	|) КАК РаботникиПериод
	|
	|";
	
	Возврат ТекстСотрудникиОрганизации;
	
КонецФункции

// Расчитывает среднесписочную численность штатных работников и в эквиваленте полной занятости.
//
// Параметры
//  ВидСредней  – Строка – "ЭПЗ", "ССЧ"
//  ВидПериода  – Строка – "МЕСЯЦ", "КВАРТАЛ", "ГОД", "КВАРТАЛСНАЧАЛАГОДА", "МЕСЯЦСНАЧАЛАГОДА" 
//  Организация  – ссылка – организация
//  ПараметрОтбора  – Строка – "" = по всем, "Ж" = Женщины, "Инв" = Инвалиды, 
//					"Пен" = пенсионеры, "ГПХ" - работающие по договору ГПХ
//  ПоФизЛицам      – Булево – разворачивать или нет до физ. лиц.
//
// Возвращаемое число:
//   таблица значений   – Колонки: Период и Сумма.
//
Функция ПолучитьОтбор(знач ПараметрОтбора = "") Экспорт
	
	ПараметрОтбора = Врег(ПараметрОтбора);
	Запрос = Новый Запрос;
                                                               
	Запрос.УстановитьПараметр("парамНачало",		НачалоПериода);
	Запрос.УстановитьПараметр("парамКонец",			КонецМесяца(КонецПериода) );
	Запрос.УстановитьПараметр("парамОрганизация",	ПостроительОтчета.Отбор.Организация.Значение);
	                                   
	УсловиеОтбора = "";
	Если ПараметрОтбора = "ЖЕНЩИНЫ" ИЛИ ПараметрОтбора = "ЖІНКИ"Тогда
		
		УсловиеОтбора = "И Работники.Сотрудник.ФизическоеЛицо.Пол = &парамОтбора";
		Запрос.УстановитьПараметр("парамОтбора", Перечисления.ПолФизическогоЛица.Женский);
		
	КонецЕсли;
	ТекстСотрудникиОрганизации = ПолучитьСотрудников( УсловиеОтбора );
	
 
	Если ПараметрОтбора = "ИНВАЛИДЫ" ИЛИ ПараметрОтбора = "ІНВАЛІДИ" Тогда
		
		Признак = "Инвалидность";
		ИмяРегистраСведений = "СведенияОбИнвалидностиФизическихЛиц";
		
	ИначеЕсли (ПараметрОтбора = "ПЕНСИОНЕРЫ" ИЛИ ПараметрОтбора = "ПЕНСІОНЕРИ") Тогда
		
		Признак = "Пенсионер";
		ИмяРегистраСведений = "СведенияОПенсионерах";
		
	ИначеЕсли ПараметрОтбора = "ПО ДОГОВОРУ ГПХ" ИЛИ ПараметрОтбора = "ЗА ДОГОВОМ ЦПХ" Тогда
		
		Признак = "СуммаЗаРаботу >= 0";
		ИмяРегистраСведений = "ДоговорникиОрганизаций";
		
	КонецЕсли; 
	Если  ПараметрОтбора = "ПЕНСИОНЕРЫ" ИЛИ ПараметрОтбора = "ПЕНСІОНЕРИ" Тогда
		
		ТекстЗапросаУсловие = "
		|ВЫБРАТЬ
		|	СписокПериод.Физлицо		КАК Физлицо,
		|	СписокПериод.Начало		КАК Начало,
		|   ВЫБОР	КОГДА СписокПериод.КОНЕЦ ЕСТЬ NULL  ИЛИ СписокПериод.КОНЕЦ > &парамКонец
		|   			ТОГДА &парамКонец 
		|   		ИНАЧЕ  НАЧАЛОПЕРИОДА( ДОБАВИТЬКДАТЕ( СписокПериод.КОНЕЦ, ДЕНЬ,-1), ДЕНЬ)  
		|   		КОНЕЦ     КАК КОНЕЦ
		|
		|	ИЗ (ВЫБРАТЬ
		|			СписокНачало.Физлицо		КАК Физлицо,
		|			СписокНачало.Начало			КАК Начало,
		|			МИНИМУМ(Список.Период)    	КАК КОНЕЦ
		|
		|		ИЗ	(
		|
		|			ВЫБРАТЬ
		|				Список.Физлицо		КАК Физлицо,
		|				&парамНачало			КАК Начало
		|			ИЗ	РегистрСведений." + ИмяРегистраСведений + ".СрезПоследних(&парамНачало) КАК Список
		|			ГДЕ	Список." + Признак + "
		|
		|			ОБЪЕДИНИТЬ ВСЕ
		|			ВЫБРАТЬ
		|				Список.Физлицо			КАК Физлицо,
		|				Список.Период			КАК Начало
		|			ИЗ	РегистрСведений." + ИмяРегистраСведений + " КАК Список
		|			ГДЕ	Список." + Признак + "
		|			И	Список.Период >= &парамНачало
		|			И	Список.Период <= &парамКонец
		|
		|   	) КАК СписокНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистраСведений + " КАК Список
		|		ПО		СписокНачало.Физлицо = Список.Физлицо
		|			И	СписокНачало.Начало < Список.Период
		|			И	не Список." + Признак + "
		|
		|   	СГРУППИРОВАТЬ ПО
		|			СписокНачало.Физлицо,
		|			СписокНачало.Начало
		|
		|) КАК СписокПериод
		|
		|";
		
		ТекстСотрудникиОрганизации = "                              
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.Сотрудник		КАК Сотрудник,			
		|   	// макс. начало
		|   	ВЫБОР КОГДА Основной.Начало < УсловиеПериод.Начало ТОГДА УсловиеПериод.Начало ИНАЧЕ  Основной.Начало КОНЕЦ     КАК Начало,
		|   	// мин. концы                                                         
		|		ВЫБОР КОГДА Основной.Конец < УсловиеПериод.Конец ТОГДА Основной.Конец ИНАЧЕ  УсловиеПериод.Конец КОНЕЦ     КАК КОНЕЦ
		|
		|	ИЗ ( " + СтрЗаменить(ТекстСотрудникиОрганизации,"РАЗРЕШЕННЫЕ","") + " ) КАК Основной
		|  
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ( " + ТекстЗапросаУсловие + " ) КАК УсловиеПериод
		|	ПО		Основной.Сотрудник.Физическоелицо = УсловиеПЕРИОД.Физлицо
		|		И	Основной.Начало <= УсловиеПериод.Конец
		|		И	УсловиеПериод.Начало <= Основной.Конец
		|";

		
	ИначеЕсли ПараметрОтбора = "ИНВАЛИДЫ" ИЛИ ПараметрОтбора = "ІНВАЛІДИ" Тогда	
		ТекстЗапросаУсловие = 

		"ВЫБРАТЬ
		|	СписокПериод.Физлицо КАК Физлицо,
		|	СписокПериод.Начало КАК Начало,
		|	ВЫБОР
		|		КОГДА СписокПериод.КОНЕЦ ЕСТЬ NULL
		|				ИЛИ СписокПериод.КОНЕЦ > &парамКонец
		|			ТОГДА &парамКонец
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(СписокПериод.КОНЕЦ, ДЕНЬ, -1), ДЕНЬ)
		|	КОНЕЦ КАК КОНЕЦ
		|ИЗ
		|	(ВЫБРАТЬ
		|		СписокНачало.Физлицо КАК Физлицо,
		|		СписокНачало.Начало КАК Начало,
		|		МИНИМУМ(Список.Период) КАК КОНЕЦ
		|	ИЗ
		|		(ВЫБРАТЬ
		|			Список.ФизическоеЛицо КАК Физлицо,
		|			&парамНачало КАК Начало
		|		ИЗ
		|			РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.СрезПоследних(&парамНачало, ) КАК Список
		|		ГДЕ
		|			Список.Инвалидность
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			Список.ФизическоеЛицо,
		|			Список.Период
		|		ИЗ
		|			РегистрСведений.СведенияОбИнвалидностиФизическихЛиц КАК Список
		|		ГДЕ
		|			Список.Инвалидность
		|			И Список.Период >= &парамНачало
		|			И Список.Период <= &парамКонец) КАК СписокНачало
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОбИнвалидностиФизическихЛиц КАК Список
		|			ПО СписокНачало.Физлицо = Список.ФизическоеЛицо
		|				И СписокНачало.Начало < Список.Период
		|				И (НЕ Список.Инвалидность)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		СписокНачало.Физлицо,
		|		СписокНачало.Начало) КАК СписокПериод";
		
		
		ТекстСотрудникиОрганизации = "                              
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.Сотрудник		КАК Сотрудник,			
		|   	// макс. начало
		|   	ВЫБОР КОГДА Основной.Начало < УсловиеПериод.Начало ТОГДА УсловиеПериод.Начало ИНАЧЕ  Основной.Начало КОНЕЦ     КАК Начало,
		|   	// мин. концы                                                         
		|		ВЫБОР КОГДА Основной.Конец < УсловиеПериод.Конец ТОГДА Основной.Конец ИНАЧЕ  УсловиеПериод.Конец КОНЕЦ     КАК КОНЕЦ
		|
		|	ИЗ ( " + СтрЗаменить(ТекстСотрудникиОрганизации,"РАЗРЕШЕННЫЕ","") + " ) КАК Основной
		|  
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ( " + ТекстЗапросаУсловие + " ) КАК УсловиеПериод
		|	ПО		Основной.Сотрудник.Физическоелицо = УсловиеПЕРИОД.Физлицо
		|		И	Основной.Начало <= УсловиеПериод.Конец
		|		И	УсловиеПериод.Начало <= Основной.Конец
		|";
	ИначеЕсли	ПараметрОтбора = "ПО ДОГОВОРУ ГПХ" ИЛИ ПараметрОтбора = "ЗА ДОГОВОРОМ ЦПХ" Тогда
		
		ТекстСотрудникиОрганизации = "                              
		|	ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|		Основной.Сотрудник		КАК Сотрудник,			
		|   	// макс. начало
		|   	ВЫБОР КОГДА &парамНачало < Основной.ДатаНачала ТОГДА Основной.ДатаНачала ИНАЧЕ  &парамНачало КОНЕЦ     КАК Начало,
		|   	// мин. концы                                                         
		|		ВЫБОР КОГДА &парамКонец < Основной.ДатаОкончания ТОГДА &парамКонец ИНАЧЕ  Основной.ДатаОкончания КОНЕЦ     КАК КОНЕЦ
		|
		|	ИЗ Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом КАК Основной
		|	ГДЕ		Основной.ДатаОкончания >= &парамНачало
		|		И	Основной.ДатаНачала <= &парамКонец
		|";
	КонецЕсли; 
	
	Запрос.Текст = ТекстСотрудникиОрганизации;
	спФизЛиц = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
	
	Возврат спФизЛиц;
	
КонецФункции // ПолучитьСреднюю()

// Процедура ЗаполнитьНачальныеНастройки
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ТекстСотрудникиОрганизации = ПолучитьСотрудников("И Работники.Сотрудник в (&парамФизЛицо)");
	ТекстСотрудникиОрганизации = СтрЗаменить(ТекстСотрудникиОрганизации,"РАЗРЕШЕННЫЕ","");
	
	ПостроительОтчета.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РаботникиОрганизаций.Организация              КАК Организация,
	|	РаботникиОрганизаций.ПодразделениеОрганизации.Представление КАК Подразделение,
	|	РаботникиОрганизаций.Сотрудник.ФизическоеЛицо.Наименование                   КАК ФизЛицо,
	|	Данные.Буква                                       			КАК Буква,
	|	Данные.НормаЧасовЗаМесяц                   					КАК НормаЧасовЗаМесяц,
	|   СУММА( ВЫБОР КОГДА Данные.НормаЧасовЗаМесяц ЕСТЬ NULL ИЛИ Данные.НормаЧасовЗаМесяц = 0 ТОГДА 0 ИНАЧЕ Данные.НормаЧасов / (Данные.НормаЧасовЗаМесяц) КОНЕЦ ) КАК Средняя,   //*&парамКоличествоМесяцев
	|	СУММА(Данные.НормаЧасов)                                   	КАК Результат
	|
	|ИЗ	( " + ТекстСотрудникиОрганизации + " ) КАК РаботникиОрганизаций
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ (
	|	ВЫБРАТЬ
	|		ОсновныеНачисления.Организация                      					КАК Организация,
	|		ОсновныеНачисления.Сотрудник                          					КАК Сотрудник,
	|		ОсновныеНачисления.ПериодДействияНачало                           		КАК ПериодДействияНачало,
	|		ОсновныеНачисления.ПериодДействияКонец                           		КАК ПериодДействияКонец,
	|		ОсновныеНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени	КАК Буква,
	|		ОсновныеНачисления.НормаЧасовЗаМесяц									КАК НормаЧасовЗаМесяц,
	|		СУММА(ОсновныеНачисления.НормаЧасов)									КАК НормаЧасов
	|		
	|	ИЗ	РегистрРасчета.ИНАГРО_Начисления КАК ОсновныеНачисления
	|	
	|	
	|	ГДЕ	ОсновныеНачисления.ПериодРегистрации <= &парамКонец 
	|	И	ОсновныеНачисления.ПериодДействияНачало >= &парамНачало                
	|	И	ОсновныеНачисления.ПериодДействияКонец <= &парамКонец 
	|	И	ОсновныеНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени <> &парамПустаяБуква
	|	И	НЕ (ОсновныеНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.ИНАГРО_КлассификаторИспользованияРабочегоВремени.ОтпускПоУходуЗаРебенком)
	|	    ИЛИ ОсновныеНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени = ЗНАЧЕНИЕ(Справочник.ИНАГРО_КлассификаторИспользованияРабочегоВремени.ОтпускПоБеременностиИРодам))
	|	И	ЕСТЬNULL(ОсновныеНачисления.НормаЧасовЗаМесяц,0) <> 0
	|	И	ЕСТЬNULL(ОсновныеНачисления.НормаЧасов,0) <> 0
	|		
	|	СГРУППИРОВАТЬ ПО
	|		ОсновныеНачисления.Организация,
	|		ОсновныеНачисления.Сотрудник,
	|		ОсновныеНачисления.ПериодДействияНачало,
	|		ОсновныеНачисления.ПериодДействияКонец,
	|		ОсновныеНачисления.ВидРасчета.ОбозначениеВТабелеУчетаРабочегоВремени,
	|		ОсновныеНачисления.НормаЧасовЗаМесяц
	|		
	|		
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		РаботникиОрганизаций.Организация					КАК Организация,
	|		РаботникиОрганизаций.Сотрудник						КАК Сотрудник,
	|		Календарь.ДатаКалендаря								КАК ПериодДействияНачало,
	|		Календарь.ДатаКалендаря								КАК ПериодДействияКонец,
	|		&ОбозначениеРабочееВремя							КАК Буква,
	|		ДЕНЬ(КОНЕЦПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ))	КАК НормаЧасовЗаМесяц,
	|		МАКСИМУМ( ВЫБОР КОГДА РаботникиОрганизаций.Сотрудник ЕСТЬ NULL ТОГДА 0 ИНАЧЕ 1 КОНЕЦ )	КАК НормаЧасов
	|
	|	ИЗ	 РегистрСведений.ИНАГРО_РегламентированныйПроизводственныйКалендарь КАК Календарь
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом КАК РаботникиОрганизаций
	|	ПО	РаботникиОрганизаций.ДатаОкончания >= Календарь.ДатаКалендаря
	|	И	РаботникиОрганизаций.ДатаНачала <= Календарь.ДатаКалендаря
	|
	|	ГДЕ	Календарь.ДатаКалендаря >= &парамНачало
	|	И	Календарь.ДатаКалендаря <= &парамКонец
	|
	|	СГРУППИРОВАТЬ ПО
	|		РаботникиОрганизаций.Организация,
	|		РаботникиОрганизаций.Сотрудник,
	|		Календарь.ДатаКалендаря,
	|		Календарь.ДатаКалендаря,
	|		ДЕНЬ(КОНЕЦПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ))
	|	
	|) КАК Данные
	|ПО	РаботникиОрганизаций.Сотрудник		= Данные.Сотрудник 
	|И	РаботникиОрганизаций.Организация	= Данные.Организация
	|И	РаботникиОрганизаций.Начало	<= Данные.ПериодДействияНачало
	|И	РаботникиОрганизаций.Конец	>= Данные.ПериодДействияКонец   
	|
	|
	|ГДЕ	Данные.Буква ЕСТЬ НЕ NULL 
	|
	|{ГДЕ РаботникиОрганизаций.Организация 				КАК Организация,
	|	  РаботникиОрганизаций.ПодразделениеОрганизации КАК Подразделение}	
	|
	|СГРУППИРОВАТЬ ПО
	|	РаботникиОрганизаций.Организация,
	|	РаботникиОрганизаций.ПодразделениеОрганизации,
	|	РаботникиОрганизаций.Сотрудник,
	|	Данные.Буква,
	|	Данные.НормаЧасовЗаМесяц
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Подразделение,
	|	ФизЛицо,
	|	Буква
	|
	|ИТОГИ СУММА(Средняя), СУММА(Результат), МАКСИМУМ(НормаЧасовЗаМесяц) ПО      // СУММА(ФОТ), 
	|	Общие,
	|	Организация,
	|	Подразделение,
	|	ФизЛицо,
	|	НормаЧасовЗаМесяц
    |	
	|
	|{ИТОГИ ПО
	|	Организация,
	|	Подразделение,
	|	НормаЧасовЗаМесяц,
	|	ФизЛицо,
	|	Буква
	|   }
	|";
	
    ПостроительОтчета.ЗаполнитьНастройки();
	
	СтруктураПредставлениеПолей = Новый Структура("Физлицо,ИмяВидаРасчета",
												  "Работник","Буква");
		
	ПостроительОтчета.Отбор.Добавить("Организация");
	ПостроительОтчета.Отбор.Добавить("Подразделение");
	
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Буква");
	
КонецПроцедуры

#КонецОбласти
